int main()
{
    int s[11]={23,20,2,-1,-25,16,0,-11,-4,7};
    int i,j,d;
    d=5;    /*确定固定增虽值*/
    while(d>=1)
    {
        for(i=d+1;i<=10;i++)    /*数组下标从d+1开始进行直接插入排序*/
        {
            s[0]=s[i];    /*设置监视哨*/
            j=i-d;    /*确定要进行比较的元素的最右边位置*/
            while((j>0)&&(s[0]<s[j]))
            {
                s[j+d]=s[j];    /*数据右移*/
                j=j-d;    /*向左移d个位置V*/
            }
            s[j + d]=s[0];    /*在确定的位罝插入s[i]*/
        }
        d = d/2;    /*增里变为原来的一半*/
    }
}